In [1]:
import pandas as pd
import numpy as np
import os
import env
from env import host, user, pwd

In [2]:
def get_db_url(database):
    return f'mysql+pymysql://{user}:{pwd}@{host}/{database}'
    '''
    Function reads in credentials from env.py file of the user and returns zillow data.
    '''

def get_singlefam_data():
    filename = "zillow.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        query = '''
        SELECT bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, 
            taxvaluedollarcnt, yearbuilt, taxamount, fips 
        FROM properties_2017
        WHERE propertylandusetypeid = 261
        '''
        df = pd.read_sql(query,get_db_url('zillow'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)

        # Return the dataframe to the calling code
        return df
def wrangle_zillow():
    '''
    Read zillow into a pandas DataFrame from mySQL
    drop unnamed column,
    drop any rows with Null values, 
    convert columns data types accordingly,
    return cleaned zillow DataFrame.
    '''
    # Acquire data 
    props = get_singlefam_data()

    # Drop all rows with NaN values.
    df = props.dropna()
    # Drop unneeded columns
    df = df.drop(columns='Unnamed: 0')
    # Convert to correct datatype
    df['yearbuilt'] = df.yearbuilt.astype(int)
    df['calculatedfinishedsquarefeet'] = df.calculatedfinishedsquarefeet.astype(int)
    df['fips'] = df.fips.astype(int)
    df['bedroomcnt'] = df.bedroomcnt.astype(int)
    df['taxvaluedollarcnt'] = df.taxvaluedollarcnt.astype(int)
    # rename columns
    df = df.rename(columns={'taxvaluedollarcnt':'tax_val_dollar_count'})
    df = df.rename(columns={'yearbuilt':'year_built'})
    df = df.rename(columns={'taxamount':'tax_amt'})
    df = df.rename(columns={'bedroomcnt':'bed_rooms'})
    df = df.rename(columns={'bathroomcnt':'bath_rooms'})
    df = df.rename(columns={'calculatedfinishedsquarefeet':'finished_sqft'})
    return df

In [3]:
wrangle_zillow()

,bed_rooms,bath_rooms,finished_sqft,tax_val_dollar_count,year_built,tax_amt,fips
4,4,2.0,3633,296425,2005,6941.39,6037
6,3,4.0,1620,847770,2011,10244.94,6037
7,3,2.0,2077,646760,1926,7924.68,6037
11,0,0.0,1200,5328,1972,91.60,6037
14,0,0.0,171,6920,1973,255.17,6037
...,...,...,...,...,...,...,...
2152856,4,4.0,4375,422400,2015,13877.56,6037
2152858,4,3.0,2262,960756,2015,13494.52,6059
2152859,4,4.5,3127,536061,2014,6244.16,6059
2152861,3,2.5,1974,424353,2015,5302.70,6059
2152862,4,4.0,2110,554009,2014,6761.20,6037

In [4]:
# Yeay!!! It works!

In [2]:

def get_db_url(database):
    return f'mysql+pymysql://{user}:{pwd}@{host}/{database}'
    '''
    Function reads in credentials from env.py file of the user and returns telco data.
    '''

def get_student_data():
    filename = "student_grades.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM student_grades', get_db_url('school_sample'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)

        # Return the dataframe to the calling code
        return df
def wrangle_grades():
    '''
    Read student_grades into a pandas DataFrame from mySQL,
    drop student_id column, replace whitespaces with NaN values,
    drop any rows with Null values, convert all columns to int64,
    return cleaned student grades DataFrame.
    '''

    # Acquire data

    grades = get_student_data()

    # Replace white space values with NaN values.
    grades = grades.replace(r'^\s*$', np.nan, regex=True)

    # Drop all rows with NaN values.
    df = grades.dropna()

    # Convert all columns to int64 data types.
    df = df.astype('int')

    return df

In [3]:
def get_db_url(database):
    return f'mysql+pymysql://{user}:{pwd}@{host}/{database}'
    '''
    Function reads in credentials from env.py file of the user and returns zillow data.
    '''

def get_singlefam_data():
    filename = "zillow.csv"

    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        query = '''
        SELECT bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, 
            taxvaluedollarcnt, yearbuilt, taxamount, fips 
        FROM properties_2017
        WHERE propertylandusetypeid = 261
        '''
        df = pd.read_sql(query,get_db_url('zillow'))

        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)

        # Return the dataframe to the calling code
        return df
def wrangle_zillow():
    '''
    Read zillow into a pandas DataFrame from mySQL
    drop unnamed column,
    drop any rows with Null values, 
    convert columns data types accordingly,
    return cleaned zillow DataFrame.
    '''
    # Acquire data 
    props = get_singlefam_data()

    # Drop all rows with NaN values.
    df = props.dropna()
    # Drop unneeded columns
    df = df.drop(columns='Unnamed: 0')
    # Convert to correct datatype
    df['yearbuilt'] = df.yearbuilt.astype(int)
    df['calculatedfinishedsquarefeet'] = df.calculatedfinishedsquarefeet.astype(int)
    df['fips'] = df.fips.astype(int)
    df['bedroomcnt'] = df.bedroomcnt.astype(int)
    df['taxvaluedollarcnt'] = df.taxvaluedollarcnt.astype(int)
    # rename columns
    df = df.rename(columns={'taxvaluedollarcnt':'tax_val_dollar_count'})
    df = df.rename(columns={'yearbuilt':'year_built'})
    df = df.rename(columns={'taxamount':'tax_amt'})
    df = df.rename(columns={'bedroomcnt':'bed_rooms'})
    df = df.rename(columns={'bathroomcnt':'bath_rooms'})
    df = df.rename(columns={'calculatedfinishedsquarefeet':'finished_sqft'})
    return df

In [4]:
df = get_singlefam_data()

In [5]:
df

,Unnamed: 0,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0,0.0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,1,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
2,2,0.0,0.0,NaN,10.0,NaN,NaN,6037.0
3,3,0.0,0.0,NaN,2108.0,NaN,174.21,6037.0
4,4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0
...,...,...,...,...,...,...,...,...
2152858,2152858,4.0,3.0,2262.0,960756.0,2015.0,13494.52,6059.0
2152859,2152859,4.0,4.5,3127.0,536061.0,2014.0,6244.16,6059.0
2152860,2152860,0.0,0.0,NaN,208057.0,NaN,5783.88,6059.0
2152861,2152861,3.0,2.5,1974.0,424353.0,2015.0,5302.70,6059.0
2152862,2152862,4.0,4.0,2110.0,554009.0,2014.0,6761.20,6037.0

In [7]:
#2152863 rows and 8 columns
# Allows us to see all non null we want it to match total
df.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2152863 entries, 0 to 2152862
Data columns (total 8 columns):
 #   Column                        Non-Null Count    Dtype
---  ------                        --------------    -----
 0   Unnamed: 0                    2152863 non-null  int64
 1   bedroomcnt                    2152852 non-null  float64
 2   bathroomcnt                   2152852 non-null  float64
 3   calculatedfinishedsquarefeet  2144379 non-null  float64
 4   taxvaluedollarcnt             2152370 non-null  float64
 5   yearbuilt                     2143526 non-null  float64
 6   taxamount                     2148421 non-null  float64
 7   fips                          2152863 non-null  float64
dtypes: float64(7), int64(1)
memory usage: 131.4 MB

In [8]:
df.isnull().sum()

Unnamed: 0                         0
bedroomcnt                        11
bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [9]:
# removed null values in df
df = df.dropna()

In [10]:
df.isnull().sum()

Unnamed: 0                      0
bedroomcnt                      0
bathroomcnt                     0
calculatedfinishedsquarefeet    0
taxvaluedollarcnt               0
yearbuilt                       0
taxamount                       0
fips                            0
dtype: int64

In [11]:
df.describe()

,Unnamed: 0,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
count,2.140235e+06,2.140235e+06,2.140235e+06,2.140235e+06,2.140235e+06,2.140235e+06,2.140235e+06,2.140235e+06
mean,1.076423e+06,3.301419e+00,2.240352e+00,1.863194e+03,4.606416e+05,1.960968e+03,5.616711e+03,6.048310e+03
std,6.214480e+05,9.325998e-01,9.905489e-01,1.221754e+03,6.771576e+05,2.215056e+01,7.814563e+03,2.034491e+01
min,4.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,2.200000e+01,1.801000e+03,6.340000e+00,6.037000e+03
25%,5.382735e+05,3.000000e+00,2.000000e+00,1.258000e+03,1.891660e+05,1.949000e+03,2.540850e+03,6.037000e+03
50%,1.076350e+06,3.000000e+00,2.000000e+00,1.623000e+03,3.282960e+05,1.958000e+03,4.111470e+03,6.037000e+03
75%,1.614602e+06,4.000000e+00,3.000000e+00,2.208000e+03,5.346060e+05,1.976000e+03,6.411930e+03,6.059000e+03
max,2.152862e+06,2.500000e+01,3.200000e+01,9.525760e+05,9.018846e+07,2.016000e+03,1.078102e+06,6.111000e+03

In [12]:
df.size

17121880

In [13]:
df.shape

(2140235, 8)

In [14]:
df = df.drop(columns='Unnamed: 0')

In [15]:
df

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,4.0,2.0,3633.0,296425.0,2005.0,6941.39,6037.0
6,3.0,4.0,1620.0,847770.0,2011.0,10244.94,6037.0
7,3.0,2.0,2077.0,646760.0,1926.0,7924.68,6037.0
11,0.0,0.0,1200.0,5328.0,1972.0,91.60,6037.0
14,0.0,0.0,171.0,6920.0,1973.0,255.17,6037.0
...,...,...,...,...,...,...,...
2152856,4.0,4.0,4375.0,422400.0,2015.0,13877.56,6037.0
2152858,4.0,3.0,2262.0,960756.0,2015.0,13494.52,6059.0
2152859,4.0,4.5,3127.0,536061.0,2014.0,6244.16,6059.0
2152861,3.0,2.5,1974.0,424353.0,2015.0,5302.70,6059.0
2152862,4.0,4.0,2110.0,554009.0,2014.0,6761.20,6037.0

In [16]:
df['yearbuilt'] = df.yearbuilt.astype(int)

In [18]:
df

,bedroomcnt,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,4.0,2.0,3633.0,296425.0,2005,6941.39,6037.0
6,3.0,4.0,1620.0,847770.0,2011,10244.94,6037.0
7,3.0,2.0,2077.0,646760.0,1926,7924.68,6037.0
11,0.0,0.0,1200.0,5328.0,1972,91.60,6037.0
14,0.0,0.0,171.0,6920.0,1973,255.17,6037.0
...,...,...,...,...,...,...,...
2152856,4.0,4.0,4375.0,422400.0,2015,13877.56,6037.0
2152858,4.0,3.0,2262.0,960756.0,2015,13494.52,6059.0
2152859,4.0,4.5,3127.0,536061.0,2014,6244.16,6059.0
2152861,3.0,2.5,1974.0,424353.0,2015,5302.70,6059.0
2152862,4.0,4.0,2110.0,554009.0,2014,6761.20,6037.0

In [17]:
df['calculatedfinishedsquarefeet'] = df.calculatedfinishedsquarefeet.astype(int)

In [19]:
df['bedroomcnt'] = df.bedroomcnt.astype(int)

In [20]:
df['fips'] = df.fips.astype(int)

In [22]:
df['taxvaluedollarcnt'] = df.taxvaluedollarcnt.astype(int)

In [25]:
df = df.rename(columns={'bedroomcnt':'bed_rooms'})

In [27]:
df = df.rename(columns={'bathroomcnt':'bath_rooms'})

In [29]:
df = df.rename(columns={'calculatedfinishedsquarefeet':'finished_sqft'})

In [33]:

df = df.rename(columns={'yearbuilt':'year_built'})
df = df.rename(columns={'taxamount':'tax_amt'})

In [37]:
df = df.rename(columns={'tax_value_dllrs':'tax_val_dollar_count'})

In [38]:
df

,bed_rooms,bath_rooms,finished_sqft,tax_val_dollar_count,year_built,tax_amt,fips
4,4,2.0,3633,296425,2005,6941.39,6037
6,3,4.0,1620,847770,2011,10244.94,6037
7,3,2.0,2077,646760,1926,7924.68,6037
11,0,0.0,1200,5328,1972,91.60,6037
14,0,0.0,171,6920,1973,255.17,6037
...,...,...,...,...,...,...,...
2152856,4,4.0,4375,422400,2015,13877.56,6037
2152858,4,3.0,2262,960756,2015,13494.52,6059
2152859,4,4.5,3127,536061,2014,6244.16,6059
2152861,3,2.5,1974,424353,2015,5302.70,6059
2152862,4,4.0,2110,554009,2014,6761.20,6037